<?xml version="1.0" encoding="utf-8"?>
<!--  (c) 2015 Microsoft Corporation  -->
<policyDefinitionResources xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" revision="1.0" schemaVersion="1.0" xmlns="http://schemas.microsoft.com/GroupPolicy/2006/07/PolicyDefinitions">
  <displayName>enter display name here</displayName>
  <description>enter description here</description>
  <resources>
    <stringTable>
      <string id="AllowTelemetry">Allow Diagnostic Data</string>
      <string id="AllowTelemetry_0">Diagnostic data off (not recommended)</string>
      <string id="AllowTelemetry_1">Send required diagnostic data</string>
      <string id="AllowTelemetry_3">Send optional diagnostic data</string>
      <string id="AllowTelemetry_Explain">By configuring this policy setting you can adjust what diagnostic data is collected from Windows. This policy setting also restricts the user from increasing the amount of diagnostic data collection via the Settings app. The diagnostic data collected under this policy impacts the operating system and apps that are considered part of Windows and does not apply to any additional apps installed by your organization.

    - Diagnostic data off (not recommended). Using this value, no diagnostic data is sent from the device. This value is only supported on Enterprise, Education, and Server editions.
    - Send required diagnostic data. This is the minimum diagnostic data necessary to keep Windows secure, up to date, and performing as expected. Using this value disables the "Optional diagnostic data" control in the Settings app.
    - Send optional diagnostic data. Additional diagnostic data is collected that helps us to detect, diagnose and fix issues, as well as make product improvements. Required diagnostic data will always be included when you choose to send optional diagnostic data.  Optional diagnostic data can also include diagnostic log files and crash dumps. Use the "Limit Dump Collection" and the "Limit Diagnostic Log Collection" policies for more granular control of what optional diagnostic data is sent.

If you disable or do not configure this policy setting, the device will send required diagnostic data and the end user can choose whether to send optional diagnostic data from the Settings app.

Note:
The "Configure diagnostic data opt-in settings user interface" group policy can be used to prevent end users from changing their data collection settings.
      </string>

      <string id="TelemetryProxy">Configure Connected User Experiences and Telemetry</string>
      <string id="TelemetryProxy_Explain">With this policy setting, you can forward Connected User Experience and Telemetry requests to a proxy server.

If you enable this policy setting, you can specify the FQDN or IP address of the destination device within your organization's network (and optionally a port number, if desired). The connection will be made over a Secure Sockets Layer (SSL) connection.  If the named proxy fails, or if you disable or do not configure this policy setting, Connected User Experience and Telemetry data will be sent to Microsoft using the default proxy configuration.

The format for this setting is &lt;server&gt;:&lt;port&gt; 
      </string>

      <string id="CommercialId">Configure the Commercial ID</string>
      <string id="CommercialId_Explain">This policy setting defines the identifier used to uniquely associate this device’s diagnostic data data as belonging to a given organization. If your organization is participating in a program that requires this device to be identified as belonging to your organization then use this setting to provide that identification. The value for this setting will be provided by Microsoft as part of the onboarding process for the program. 

If you disable or do not configure this policy setting, then Microsoft will not be able to use this identifier to associate this machine and its diagnostic data data with your organization.
      </string>

      <string id="DisableEnterpriseAuthProxy">Configure Authenticated Proxy usage for the Connected User Experience and Telemetry service</string>
      <string id="DisableEnterpriseAuthProxy_1">Enable Authenticated Proxy usage</string>
      <string id="DisableEnterpriseAuthProxy_2">Disable Authenticated Proxy usage</string>
      <string id="DisableEnterpriseAuthProxy_Explain">This policy setting blocks the Connected User Experience and Telemetry service from automatically using an authenticated proxy to send data back to Microsoft on Windows 10. If you disable or do not configure this policy setting, the Connected User Experience and Telemetry service will automatically use an authenticated proxy to send data back to Microsoft. Enabling this policy will block the Connected User Experience and Telemetry service from automatically using an authenticated proxy.</string>

      <string id="LimitEnhancedDiagnosticDataWindowsAnalytics">Limit optional diagnostic data for Desktop Analytics</string>
      <string id="LimitEnhancedDiagnosticDataWindowsAnalytics_1">Enable Desktop Analytics collection</string>
      <string id="LimitEnhancedDiagnosticDataWindowsAnalytics_2">Disable Desktop Analytics collection</string>
      <string id="LimitEnhancedDiagnosticDataWindowsAnalytics_Explain">This policy setting, in combination with the "Allow Diagnostic Data" policy setting, enables organizations to send the minimum data required by Desktop Analytics.

To enable the behavior described above, complete the following steps:
    1. Enable this policy setting
    2. Set the "Allow Diagnostic Data" policy to "Send optional diagnostic data"
    3. Enable the "Limit Dump Collection" policy 
    4. Enable the "Limit Diagnostic Log Collection" policy

When these policies are configured, Microsoft will collect only required diagnostic data and the events required by Desktop Analytics, which can be viewed at https://go.microsoft.com/fwlink/?linkid=2116020.

If you disable or do not configure this policy setting, diagnostic data collection is determined by the "Allow Diagnostic Data" policy setting or by the end user from the Settings app.
      </string>

      <string id="AllowDeviceNameInDiagnosticData">Allow device name to be sent in Windows diagnostic data</string>
      <string id="AllowDeviceNameInDiagnosticData_Explain">This policy allows the device name to be sent to Microsoft as part of Windows diagnostic data.

If you disable or do not configure this policy setting, then device name will not be sent to Microsoft as part of Windows diagnostic data.
      </string>

      <string id="ConfigureTelemetryOptInSettingsUx">Configure diagnostic data opt-in settings user interface</string>
      <string id="ConfigureTelemetryOptInSettingsUx_1">Disable diagnostic data opt-in settings</string>
      <string id="ConfigureTelemetryOptInSettingsUx_2">Enable diagnostic data opt-in setings</string>
      <string id="ConfigureTelemetryOptInSettingsUx_Explain">This policy setting determines whether an end user can change diagnostic data settings in the Settings app.

If you set this policy setting to "Disable diagnostic data opt-in settings", diagnostic data settings are disabled in the Settings app.

If you don't configure this policy setting, or you set it to "Enable diagnostic data opt-in settings", end users can change the device diagnostic settings in the Settings app.

Note:
To set a limit on the amount of diagnostic data that is sent to Microsoft by your organization, use the "Allow Diagnostic Data" policy setting.
      </string>

      <string id="ConfigureTelemetryOptInChangeNotification">Configure diagnostic data opt-in change notifications</string>
      <string id="ConfigureTelemetryOptInChangeNotification_1">Disable diagnostic data change notifications</string>
      <string id="ConfigureTelemetryOptInChangeNotification_2">Enable diagnostic data change notifications</string>
      <string id="ConfigureTelemetryOptInChangeNotification_Explain">This policy setting controls whether notifications are shown, following a change to diagnostic data opt-in settings, on first logon and when the changes occur in settings.

If you set this policy setting to "Disable diagnostic data change notifications", diagnostic data opt-in change notifications will not appear.

If you set this policy setting to "Enable diagnostic data change notifications" or don't configure this policy setting, diagnostic data opt-in change notifications appear at first logon and when the changes occur in Settings.
      </string>

      <string id="DisableDeviceDelete">Disable deleting diagnostic data</string>
      <string id="DisableDeviceDelete_Explain">This policy setting controls whether the Delete diagnostic data button is enabled in Diagnostic &amp; feedback Settings page.

If you enable this policy setting, the Delete diagnostic data button will be disabled in Settings page, preventing the deletion of diagnostic data collected by Microsoft from the device.

If you disable or don't configure this policy setting, the Delete diagnostic data button will be enabled in Settings page, which allows people to erase all diagnostic data collected by Microsoft from that device.
      </string>

      <string id="DisableDiagnosticDataViewer">Disable diagnostic data viewer</string>
      <string id="DisableDiagnosticDataViewer_Explain">This policy setting controls whether users can enable and launch the Diagnostic Data Viewer from the Diagnostic &amp; feedback Settings page.

If you enable this policy setting, the Diagnostic Data Viewer will not be enabled in Settings page, and it will prevent the viewer from showing diagnostic data collected by Microsoft from the device.

If you disable or don't configure this policy setting, the Diagnostic Data Viewer will be enabled in Settings page.
      </string>

      <string id="ConfigureMicrosoft365UploadEndpoint">Configure diagnostic data upload endpoint for Desktop Analytics</string>
      <string id="ConfigureMicrosoft365UploadEndpoint_Explain">This policy sets the upload endpoint for this device’s diagnostic data as part of the Desktop Analytics program.

If your organization is participating in the program and has been instructed to configure a custom upload endpoint, then use this setting to define that endpoint.
The value for this setting will be provided by Microsoft as part of the onboarding process for the program. 
      </string>

      <string id="AllowUpdateComplianceProcessing">Allow Update Compliance Processing</string>
      <string id="AllowUpdateComplianceProcessing_Explain">
This policy setting, in combination with the Allow Telemetry and Configure the Commercial ID, enables organizations to configure the device so that Microsoft is the processor of the Windows diagnostic data collected from the device, subject to the Product Terms at https://go.microsoft.com/fwlink/?linkid=2185086.
To enable this behavior:
    1. Enable this policy setting
    2. Join an Azure Active Directory account to the device
    3. Set Allow Telemetry to  value 1 - Required, or higher
    4. Set the Configure the Commercial ID setting for your Update Compliance workspace

When these policies are configured, Windows diagnostic data collected from the device will be subject to Microsoft processor commitments.
If you disable or do not configure this policy setting, devices will not appear in Update Compliance.
      </string>

      <string id="AllowDesktopAnalyticsProcessing">Allow Desktop Analytics Processing</string>
      <string id="AllowDesktopAnalyticsProcessing_Explain">
This policy setting, in combination with the Allow Telemetry and Configure the Commercial ID, enables organizations to configure the device so that Microsoft is the processor for Windows diagnostic data collected from the device, subject to the Product Terms at https://go.microsoft.com/fwlink/?linkid=2185086.
To enable this behavior:
    1. Enable this policy setting
    2. Join an Azure Active Directory account to the device
    3. Set Allow Telemetry to value 1 - Required, or higher
    4. Set the Configure the Commercial ID setting for your Desktop Analytics workspace

When these policies are configured, Windows diagnostic data collected from the device will be subject to Microsoft processor commitments.
This setting has no effect on devices unless they are properly enrolled in Desktop Analytics. If you disable this policy setting, devices will not appear in Desktop Analytics.
      </string>

      <string id="AllowWUfBCloudProcessing">Allow WUfB Cloud Processing</string>
      <string id="AllowWUfBCloudProcessing_Explain">
This policy setting configures an Azure Active Directory joined device so that Microsoft is the processor of the Windows diagnostic data collected from the device, subject to the Product Terms at https://go.microsoft.com/fwlink/?linkid=2185086.
To enable this behavior:
    1. Enable this policy setting
    2. Join an Azure Active Directory account to the device
    3. Set Allow Telemetry to  value 1 - Required, or higher

When these policies are configured, Windows diagnostic data collected from the device will be subject to Microsoft processor commitments.
If you disable or do not configure this policy setting, devices enrolled to the Windows Update for Business deployment service will not be able to take advantage of some deployment service features.
      </string>

      <string id="AllowCommercialDataPipeline">Allow commercial data pipeline</string>
      <string id="AllowCommercialDataPipeline_Explain">
AllowCommercialDataPipeline configures an Azure Active Directory joined device so that Microsoft is the processor of the Windows diagnostic data collected from the device, subject to the Product Terms at https://go.microsoft.com/fwlink/?linkid=2185086.
To enable this behavior:
    1. Enable this policy setting
    2. Join an Azure Active Directory account to the device

Windows diagnostic data is collected when the Allow Telemetry policy setting is set to value 1  - Required or above. Configuring this setting does not change the Windows diagnostic data collection level set for the device.
If you disable or do not configure this setting, Microsoft will be the controller of the Windows diagnostic data collected from the device and processed in accordance with Microsoft's privacy statement at https://go.microsoft.com/fwlink/?LinkId=521839 unless you have enabled policies like 'Allow Update Compliance Processing' or 'Allow Desktop Analytics Processing'.
See the documentation at https://go.microsoft.com/fwlink/?linkid=2011107 for information on this and other policies that will result in Microsoft being the processor of Windows diagnostic data.
      </string>

      <string id="LimitDiagnosticLogCollection">Limit Diagnostic Log Collection</string>
      <string id="LimitDiagnosticLogCollection_Explain">This policy setting controls whether additional diagnostic logs are collected when more information is needed to troubleshoot a problem on the device. Diagnostic logs are only sent when the device has been configured to send optional diagnostic data.

By enabling this policy setting, diagnostic logs will not be collected.

If you disable or do not configure this policy setting, we may occasionally collect diagnostic logs if the device has been configured to send optional diagnostic data.
      </string>

      <string id="LimitDumpCollection">Limit Dump Collection</string>
      <string id="LimitDumpCollection_Explain">This policy setting limits the type of dumps that can be collected when more information is needed to troubleshoot a problem. Dumps are only sent when the device has been configured to send optional diagnostic data.

By enabling this setting, Windows Error Reporting is limited to sending kernel mini dumps and user mode triage dumps.

If you disable or do not configure this policy setting, we may occasionally collect full or heap dumps if the user has opted to send optional diagnostic data.
      </string>

      <string id="EnableOneSettingsAuditing">Enable OneSettings Auditing</string>
      <string id="EnableOneSettingsAuditing_Explain">This policy setting controls whether Windows records attempts to connect with the OneSettings service to the EventLog.

If you enable this policy, Windows will record attempts to connect with the OneSettings service to the Microsoft\Windows\Privacy-Auditing\Operational EventLog channel.

If you disable or don't configure this policy setting, Windows will not record attempts to connect with the OneSettings service to the EventLog.
      </string>

      <string id="DisableOneSettingsDownloads">Disable OneSettings Downloads</string>
      <string id="DisableOneSettingsDownloads_Explain">This policy setting controls whether Windows attempts to connect with the OneSettings service.

If you enable this policy, Windows will not attempt to connect with the OneSettings Service.

If you disable or don't configure this policy setting, Windows will periodically attempt to connect with the OneSettings service to download configuration settings.
      </string>
    </stringTable>
    <presentationTable>
      <presentation id="AllowTelemetry">
        <dropdownList refId="AllowTelemetry" noSort="true" defaultItem="1"></dropdownList>
      </presentation>
      <presentation id="TelemetryProxy">
        <textBox refId="TelemetryProxyName">
          <label>Proxy Server Name:</label>
        </textBox>
      </presentation>
      <presentation id="CommercialID">
        <textBox refId="CommercialIdValue">
          <label>Commercial Id:</label>
        </textBox>
      </presentation>
      <presentation id="DisableEnterpriseAuthProxy">
        <dropdownList refId="DisableEnterpriseAuthProxy" noSort="true" defaultItem="1"></dropdownList>
      </presentation>
      <presentation id="LimitEnhancedDiagnosticDataWindowsAnalytics">
        <dropdownList refId="LimitEnhancedDiagnosticDataWindowsAnalytics" noSort="true" defaultItem="0"></dropdownList>
      </presentation>
      <presentation id="ConfigureTelemetryOptInSettingsUx">
        <dropdownList refId="ConfigureTelemetryOptInSettingsUx" noSort="true" defaultItem="0"></dropdownList>
      </presentation>
      <presentation id="ConfigureTelemetryOptInChangeNotification">
        <dropdownList refId="ConfigureTelemetryOptInChangeNotification" noSort="true" defaultItem="0"></dropdownList>
      </presentation>
      <presentation id="ConfigureMicrosoft365UploadEndpoint">
        <textBox refId="ConfigureMicrosoft365UploadEndpointValue">
          <label>Desktop Analytics Custom Upload Endpoint:</label>
        </textBox>
      </presentation>
    </presentationTable>
  </resources>
</policyDefinitionResources>
